import random
import disnake
from disnake.ext import commands

fortunes = [
    "Ты самая красивая!! 🌸",
    "Ты сегодня невероятно милая 💖",
    "Я тебя люблю больше всех 🥰",
    "Мне нравится, как ты улыбаешься 😊",
    "Твоя улыбка делает мой день лучше :3",
    "Ты оченьочень мили 🥰",
    "Твои глазки сияют как звёзды ✨",
    "Ты сладуся 💕",
    "Я тебя блюб!!😇",
    "С тобой всегда тепло и уютна мимими",
    "Сегодня твоя красота сияет 💖",
    "Твои шутки всегда поднимают настроение",
    "Ты делаешь мир ярче 💖",
    "Ты особенная и неповторимая ✨",
    "Тоя забота бесценна 💛",
    "Ты невероятно очаровательная 😍",
    "Твой взгляд согревает душу 🌸",
    "Ты словно магия вокруг ✨",
    "Ты вдохновляешь на мечты 💫",
    "Ты делаешь каждый день лучше 💖",
    "Ты мимимимим 🥰",
    "Ты мой маленький светлый лучик ☀️",
    "Ты всегда умеешь поддержать 💕",
    "Ты такая касивая!! 💖",
]

class Meow(commands.Cog):
    def __init__(self, bot):
        self.bot = bot

    @commands.slash_command(
        name="mewooo",
        description="Получить милое сообщение 💌"
    )
    async def mewooo(self, inter: disnake.ApplicationCommandInteraction):
        await inter.response.defer(ephemeral=True)
        user = inter.author
        message = random.choice(fortunes)

        embed = disnake.Embed(
            title="🔮блюб🔮",
            description=message,
            color=0xff0052
        )

        try:
            await user.send(embed=embed)
            await inter.followup.send(f"{user.mention}, я отправил тебе твоё предсказание в личку! 💌", ephemeral=True)
        except:
            await inter.followup.send("Не могу отправить личное сообщение 😢 Убедись, что у меня есть доступ к DM.", ephemeral=True)


def setup(bot):
    bot.add_cog(Meow(bot))